# Task M1 T01

## Exercise 1

Connection to the database and creation of a cursor object to execute queries. It is necessary to import *mysql.connector* to connect.

In [1]:
import mysql.connector

In [2]:
cnn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="MySQLS3rv3r"
)

crs = cnn.cursor()

### Setting the database structure
The following statements create a new schema called *movies* and then check if it has been created, showing the existing databases.

In [3]:
create_sql = "CREATE SCHEMA IF NOT EXISTS movies;"
show_sql = "SHOW DATABASES;"

crs.execute(create_sql)
crs.execute(show_sql)
for x in crs:
    print(x)

('information_schema',)
('movies',)
('mysql',)
('performance_schema',)
('sys',)

###### Common attributes
All the tables that we create have these three attributes.<br> 
> **created_by_user** stores the name of the user who created each genre. In case the value inserted is null, it  stores "*OS_SGAD*". <br>
    **created_date** stores the date when this attribute was created. <br>
    **updated_date** stores the date when this attribute was edited.

###### tb_genre
The next statement creates the genre table. It stores information about different types of genres in movies.
> **genre_id** is the primary key.
<br>**genre_name** stores the name of the genre. It cannot be null.

In [4]:
create_tb_sql = """
CREATE TABLE movies.tb_genre (
  genre_id          INTEGER NOT NULL,
  genre_name        CHARACTER VARYING(40) NOT NULL,
  created_by_user   CHARACTER VARYING (10) NOT NULL DEFAULT 'OS_SGAD',
  created_date      DATE,
  updated_date      DATE,
  CONSTRAINT pk_genre PRIMARY KEY (genre_id)
);
"""

crs.execute(create_tb_sql)

###### tb_movie 
The next statement creates the movies table. It stores information about each movie.<br>
> **movie_id** is the primary key.<br>
  **movie_title** stores the name of the movie. It cannot be null.<br>
  **movie_date** stores the date when the movie was released.<br>
  **movie_format** stores the format of the movie. Can be "*Digital*" or "*Film*".<br>
  **movie_genre_id** stores the type of genre of the movie. It is foreign key of the table *tb_genre*.

In [5]:
create_tb_sql = """ 
CREATE TABLE movies.tb_movie (
  movie_id         INTEGER NOT NULL ,
  movie_title      CHARACTER VARYING(100) NOT NULL ,
  movie_date       DATE ,
  movie_format     CHARACTER VARYING(50) ,
  movie_genre_id   INTEGER ,
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
  created_date     DATE ,
  updated_date     DATE ,
  CONSTRAINT pk_movie PRIMARY KEY (movie_id),
  CONSTRAINT fk_movie_genre FOREIGN KEY (movie_genre_id) REFERENCES movies.tb_genre (genre_id)
); 
"""

crs.execute(create_tb_sql)

###### tb_role
The next statement creates the role table. It stores information about different roles.<br>
> **role_id** is the primary key.<br>
  **role_name** stores the name of each role like "*Actor*", "*Director*", etc. It cannot be null.

In [6]:
create_tb_sql = """
CREATE TABLE movies.tb_role (
  role_id          INTEGER NOT NULL ,
  role_name        CHARACTER VARYING(60) NOT NULL ,
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
  created_date     DATE ,
  updated_date     DATE ,
  CONSTRAINT pk_role PRIMARY KEY (role_id)
);
"""

crs.execute(create_tb_sql)

###### *tb_person*
The next statement creates the person table. It stores information about each person.<br>
> **person_id** is the primary key.<br>
  **person_name** stores the name of each person. It cannot be null.<br>
  **person_country** stores the origin country. <br>
  **person_dob** stores the date of birth. It cannot be null. <br>
  **person_dod** stores the date of death. <br>
  **person_parent_id** stores the *person_id* of the parent. It is foreign key of the table *tb_person*. <br>

In [7]:
create_tb_sql = """
CREATE TABLE movies.tb_person (
  person_id        INTEGER NOT NULL ,
  person_name      CHARACTER VARYING(100) NOT NULL ,
  person_country   CHARACTER VARYING(40) , 
  person_dob       DATE NOT NULL ,
  person_dod       DATE ,
  person_parent_id INTEGER ,
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
  created_date     DATE ,
  updated_date     DATE ,
  CONSTRAINT pk_person PRIMARY KEY (person_id) ,
  CONSTRAINT fk_person_parent FOREIGN KEY (person_parent_id) REFERENCES movies.tb_person (person_id)
);
"""

crs.execute(create_tb_sql)

###### tb_movie_person
The next statement creates a table that relates each person with their role in each movie. The primary key is composed by the attributes *movie_id*, *person_id* and *role_id*.
> **movie_id** is foreign key of the table *tb_movie*. <br>
  **movie_person** is foreign key of the table *tb_person*. <br>
  **movie_role** is foreign key of the table *tb_role*. <br>
  **movie_award_ind** stores if this person has won an award for his role in this movie. It have to store 'Y' or 'N' value.

In [8]:
create_tb_sql = """
CREATE TABLE movies.tb_movie_person (
  movie_id         INTEGER NOT NULL ,
  person_id        INTEGER NOT NULL ,
  role_id          INTEGER NOT NULL ,
  movie_award_ind  CHAR(1) NOT NULL ,
  created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,
  created_date     DATE ,
  updated_date     DATE ,
  CONSTRAINT pk_movper PRIMARY KEY (movie_id, person_id, role_id) ,
  CONSTRAINT fk_movper_movie FOREIGN KEY (movie_id) REFERENCES movies.tb_movie (movie_id) ,
  CONSTRAINT fk_movper_person FOREIGN KEY (person_id) REFERENCES movies.tb_person (person_id) ,
  CONSTRAINT fk_movper_role FOREIGN KEY (role_id) REFERENCES movies.tb_role (role_id)
);
"""

crs.execute(create_tb_sql)

In [9]:
cnn.commit()

Finally, we check if all tables have been created. This time, we create a connection specifying the database.

In [10]:
cnn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="MySQLS3rv3r",
    database="movies"
)

crs = cnn.cursor()

show_sql = "SHOW TABLES;"

crs.execute(show_sql)
for x in crs:
    print(x)

('tb_genre',)
('tb_movie',)
('tb_movie_person',)
('tb_person',)
('tb_role',)

### Inserting the data
The following statements insert the data in the database. To be able to execute multiple statements at once, we have to set the parameter named **multi** from the method **execute** to "*True*".

In [11]:
insert_data_op = """
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 1, 'Acción');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 2, 'Ciencia Ficción');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 3, 'Comedia');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 4, 'Drama');
INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user) VALUES ( 5, 'Fantasía', 'apermag');
INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES ( 6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 7, 'Musical');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 8, 'Romance');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES ( 9, 'Suspense');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (10, 'Terror');
INSERT INTO movies.tb_genre (genre_id, genre_name) VALUES (11, 'Bélico');

INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 1, 'Apocalypse Now', '1979-05-10', 'Film', 11);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 2, 'Star Wars:Episode IV - A New Hope', '1977-05-25', 'Film', 2);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 3, 'Indiana Jones and the Temple of Doom', '1984-05-08', 'Film', 1);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 4, 'The Terminal', '2004-06-18', 'Digital', 3);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 5, 'Jaws', '1975-01-01', 'Film', 10);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 6, 'ET The Extraterrestrial', '1982-07-25', 'Film', 5);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 7, 'Psycho', '1960-05-06', 'Film', 9);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 8, 'Ocho Apellidos Vascos', '2014-03-14', 'Digital', 3);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES ( 9, 'Ocho Apellidos Catalanes', '2016-06-09', 'Digital', 8);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (10, 'El otro lado de la cama', '2002-09-04', 'Digital', 8);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (11, 'La Gran Familia Española', '2012-10-15', 'Digital', 3);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (12, 'El dia de la bestia', '1994-12-25', 'Film', 1);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (13, 'Braveheart', '1995-08-08', 'Film', 4);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (14, 'The Shawshank Redemption', '1992-01-07', 'Film', 4);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (15, 'Las brujas de Zugarramurdi', '2009-10-07', 'Digital', 9);
INSERT INTO movies.tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (16, 'Blade Runner', '1982-12-25', 'Digital', 2);

INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 1, 'Actor');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 2, 'Director');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 3, 'Productor');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 4, 'Guionista');
INSERT INTO movies.tb_role (role_id, role_name) VALUES ( 5, 'Música');

INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 1, 'Francis Ford Coppola', 'United States', '1939-04-07', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 2, 'Carmine Coppola', 'United States', '1945-07-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 4, 'Robert Duvall', 'United States', '1931-01-05', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 5, 'Martin Sheen', 'United States', '1940-08-03', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 6, 'Harrison Ford', 'United States', '1942-07-13', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 7, 'George Lucas', 'United States', '1944-05-14', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 8, 'Gary Kurtz', 'United States', '1940-07-27', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES ( 9, 'Steven Spielberg', 'United States', '1946-12-18', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (10, 'John Williams', 'United States', '1928-08-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (11, 'Tom Hanks', 'United States', '1956-07-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (12, 'Catherine Zeta-Jones', 'Wales', '1969-09-25', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (13, 'Alfred Joseph Hitchcock', 'United Kingdom', '1899-08-13', '1980-04-29', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (14, 'Anthony Perkins', 'United States', '1934-04-04', '1992-09-08', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (15, 'Vera Miles', 'United States', '1929-08-23', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (16, 'Emilio Martinez Lazaro', 'Spain', '1956-09-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (17, 'Dani Rovira', 'Spain', '1984-07-01', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (18, 'Clara Lago', 'Spain', '1986-04-17', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (19, 'Carmen Machi', 'Spain', '1964-08-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (20, 'Karra Elejalde', 'Spain', '1960-03-06', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (21, 'Daniel Sanchez Arevalo', 'Spain', '1970-06-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (22, 'Quim Gutierrez', 'Spain', '1981-03-27', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (23, 'Robert Alamo', 'Spain', '1970-05-06', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (24, 'Hector Colome', 'Spain', '1944-10-25', '2015-02-28', NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (25, 'Veronica Echegui', 'Spain', '1983-03-14', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (26, 'Patrick Criado', 'Spain', '1995-09-23', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (27, 'Sean Connery', 'Scotland', '1930-07-08', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (28, 'Mel Gibson', 'Australia', '1950-08-09', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (29, 'Morgan Freeman', 'United States', '1935-10-01', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (30, 'Tim Robbins', 'United States', '1949-06-07', NULL, NULL);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (41, 'Charlie Sheen', 'United States', '1965-09-03', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (42, 'Emilio Estevez', 'United States', '1962-05-12', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (43, 'Ramón Estevez', 'United States', '1963-08-07', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (44, 'Reneé Estevez', 'United States', '1967-04-02', NULL, 5);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (45, 'Paula Speert Sheen', 'United States', '1986-01-06', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (46, 'Bob Sheen', 'United States', '2009-05-01', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (47, 'Max Sheen', 'United States', '2009-05-01', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (48, 'Sam Sheen', 'United States', '2004-03-09', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (49, 'Lola Sheen', 'United States', '2005-06-01', NULL,41);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (50, 'Paula Jones-Sheen', 'United States', '2003-07-06', NULL,45);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (51, 'Paloma Rae Estevez', 'United States', '1986-02-15', NULL,42);
INSERT INTO movies.tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (52, 'Taylor Levi Estevez', 'United States', '1984-06-22', NULL,42);

INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 2, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 1, 5, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 2, 5, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 3, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 4, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 5, 1, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1,41, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 1, 6, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 6, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 7, 2, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 2, 8, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 6, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 4, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3,10, 5, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4, 9, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,11, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 4,12, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 5, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 6, 9, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,13, 3, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,14, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 7,15, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 3, 7, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,16, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,16, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,17, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,18, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,19, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 8,20, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,17, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,18, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,19, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES ( 9,20, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (10,16, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,21, 4, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,22, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,23, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,24, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,25, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (11,26, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 1, 'Y');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (13,28, 2, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,29, 1, 'N');
INSERT INTO movies.tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (14,30, 1, 'N');
"""
num_affected_rows = 0
for result in crs.execute(insert_data_op, multi = True):
    if result.with_rows:
        print(result.fetchall())
    else:
        num_affected_rows += result.rowcount 
print("Total number of affected rows: {}".format(num_affected_rows))

cnn.commit()

Total number of affected rows: 124

Now, it is possible to check that all data have been inserted in each table.

In [12]:
show_sql = "SELECT * FROM tb_genre;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Acción', 'OS_SGAD', None, None)
(2, 'Ciencia Ficción', 'OS_SGAD', None, None)
(3, 'Comedia', 'OS_SGAD', None, None)
(4, 'Drama', 'OS_SGAD', None, None)
(5, 'Fantasía', 'apermag', None, None)
(6, 'Melodrama', 'apermag', datetime.date(2018, 9, 1), datetime.date(2018, 9, 27))
(7, 'Musical', 'OS_SGAD', None, None)
(8, 'Romance', 'OS_SGAD', None, None)
(9, 'Suspense', 'OS_SGAD', None, None)
(10, 'Terror', 'OS_SGAD', None, None)
(11, 'Bélico', 'OS_SGAD', None, None)

In [13]:
show_sql = "SELECT * FROM tb_movie;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(11, 'La Gran Familia Española', datetime.date(2012, 10, 15), 'Digital', 3, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

In [14]:
show_sql = "SELECT * FROM tb_movie_person;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 1, 2, 'Y', 'OS_SGAD', None, None)
(1, 1, 3, 'N', 'OS_SGAD', None, None)
(1, 1, 5, 'N', 'OS_SGAD', None, None)
(1, 2, 5, 'N', 'OS_SGAD', None, None)
(1, 3, 1, 'N', 'OS_SGAD', None, None)
(1, 4, 1, 'N', 'OS_SGAD', None, None)
(1, 5, 1, 'Y', 'OS_SGAD', None, None)
(1, 6, 1, 'N', 'OS_SGAD', None, None)
(1, 41, 1, 'N', 'OS_SGAD', None, None)
(2, 6, 1, 'N', 'OS_SGAD', None, None)
(2, 7, 2, 'Y', 'OS_SGAD', None, None)
(2, 8, 3, 'N', 'OS_SGAD', None, None)
(3, 6, 1, 'N', 'OS_SGAD', None, None)
(3, 7, 1, 'N', 'OS_SGAD', None, None)
(3, 7, 4, 'N', 'OS_SGAD', None, None)
(3, 9, 2, 'N', 'OS_SGAD', None, None)
(3, 10, 5, 'N', 'OS_SGAD', None, None)
(4, 9, 2, 'N', 'OS_SGAD', None, None)
(4, 9, 3, 'N', 'OS_SGAD', None, None)
(4, 11, 1, 'N', 'OS_SGAD', None, None)
(4, 12, 1, 'N', 'OS_SGAD', None, None)
(5, 9, 2, 'N', 'OS_SGAD', None, None)
(6, 9, 2, 'N', 'OS_SGAD', None, None)
(7, 13, 1, 'N', 'OS_SGAD', None, None)
(7, 13, 2, 'N', 'OS_SGAD', None, None)
(7, 13, 3, 'N', 'OS_SGAD', None, None)
(7, 14, 2, 'N', 'OS_SGAD', None, None)
(7, 15, 2, 'N', 'OS_SGAD', None, None)
(8, 16, 2, 'N', 'OS_SGAD', None, None)
(8, 17, 1, 'N', 'OS_SGAD', None, None)
(8, 18, 1, 'N', 'OS_SGAD', None, None)
(8, 19, 1, 'N', 'OS_SGAD', None, None)
(8, 20, 1, 'N', 'OS_SGAD', None, None)
(9, 16, 2, 'N', 'OS_SGAD', None, None)
(9, 17, 1, 'N', 'OS_SGAD', None, None)
(9, 18, 1, 'N', 'OS_SGAD', None, None)
(9, 19, 1, 'N', 'OS_SGAD', None, None)
(9, 20, 1, 'N', 'OS_SGAD', None, None)
(10, 16, 2, 'N', 'OS_SGAD', None, None)
(11, 21, 2, 'N', 'OS_SGAD', None, None)
(11, 21, 4, 'N', 'OS_SGAD', None, None)
(11, 22, 1, 'N', 'OS_SGAD', None, None)
(11, 23, 1, 'N', 'OS_SGAD', None, None)
(11, 24, 1, 'N', 'OS_SGAD', None, None)
(11, 25, 1, 'N', 'OS_SGAD', None, None)
(11, 26, 1, 'N', 'OS_SGAD', None, None)
(13, 28, 1, 'Y', 'OS_SGAD', None, None)
(13, 28, 2, 'N', 'OS_SGAD', None, None)
(14, 29, 1, 'N', 'OS_SGAD', None, None)
(14, 30, 1, 'N', 'OS_SGAD', None, None)

In [15]:
show_sql = "SELECT * FROM tb_person;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Francis Ford Coppola', 'United States', datetime.date(1939, 4, 7), None, None, 'OS_SGAD', None, None)
(2, 'Carmine Coppola', 'United States', datetime.date(1945, 7, 8), None, None, 'OS_SGAD', None, None)
(3, 'Marlon Brando', 'United States', datetime.date(1924, 4, 3), datetime.date(2004, 7, 1), None, 'OS_SGAD', None, None)
(4, 'Robert Duvall', 'United States', datetime.date(1931, 1, 5), None, None, 'OS_SGAD', None, None)
(5, 'Martin Sheen', 'United States', datetime.date(1940, 8, 3), None, None, 'OS_SGAD', None, None)
(6, 'Harrison Ford', 'United States', datetime.date(1942, 7, 13), None, None, 'OS_SGAD', None, None)
(7, 'George Lucas', 'United States', datetime.date(1944, 5, 14), None, None, 'OS_SGAD', None, None)
(8, 'Gary Kurtz', 'United States', datetime.date(1940, 7, 27), None, None, 'OS_SGAD', None, None)
(9, 'Steven Spielberg', 'United States', datetime.date(1946, 12, 18), None, None, 'OS_SGAD', None, None)
(10, 'John Williams', 'United States', datetime.date(1928, 8, 8), None, None, 'OS_SGAD', None, None)
(11, 'Tom Hanks', 'United States', datetime.date(1956, 7, 9), None, None, 'OS_SGAD', None, None)
(12, 'Catherine Zeta-Jones', 'Wales', datetime.date(1969, 9, 25), None, None, 'OS_SGAD', None, None)
(13, 'Alfred Joseph Hitchcock', 'United Kingdom', datetime.date(1899, 8, 13), datetime.date(1980, 4, 29), None, 'OS_SGAD', None, None)
(14, 'Anthony Perkins', 'United States', datetime.date(1934, 4, 4), datetime.date(1992, 9, 8), None, 'OS_SGAD', None, None)
(15, 'Vera Miles', 'United States', datetime.date(1929, 8, 23), None, None, 'OS_SGAD', None, None)
(16, 'Emilio Martinez Lazaro', 'Spain', datetime.date(1956, 9, 9), None, None, 'OS_SGAD', None, None)
(17, 'Dani Rovira', 'Spain', datetime.date(1984, 7, 1), None, None, 'OS_SGAD', None, None)
(18, 'Clara Lago', 'Spain', datetime.date(1986, 4, 17), None, None, 'OS_SGAD', None, None)
(19, 'Carmen Machi', 'Spain', datetime.date(1964, 8, 9), None, None, 'OS_SGAD', None, None)
(20, 'Karra Elejalde', 'Spain', datetime.date(1960, 3, 6), None, None, 'OS_SGAD', None, None)
(21, 'Daniel Sanchez Arevalo', 'Spain', datetime.date(1970, 6, 8), None, None, 'OS_SGAD', None, None)
(22, 'Quim Gutierrez', 'Spain', datetime.date(1981, 3, 27), None, None, 'OS_SGAD', None, None)
(23, 'Robert Alamo', 'Spain', datetime.date(1970, 5, 6), None, None, 'OS_SGAD', None, None)
(24, 'Hector Colome', 'Spain', datetime.date(1944, 10, 25), datetime.date(2015, 2, 28), None, 'OS_SGAD', None, None)
(25, 'Veronica Echegui', 'Spain', datetime.date(1983, 3, 14), None, None, 'OS_SGAD', None, None)
(26, 'Patrick Criado', 'Spain', datetime.date(1995, 9, 23), None, None, 'OS_SGAD', None, None)
(27, 'Sean Connery', 'Scotland', datetime.date(1930, 7, 8), None, None, 'OS_SGAD', None, None)
(28, 'Mel Gibson', 'Australia', datetime.date(1950, 8, 9), None, None, 'OS_SGAD', None, None)
(29, 'Morgan Freeman', 'United States', datetime.date(1935, 10, 1), None, None, 'OS_SGAD', None, None)
(30, 'Tim Robbins', 'United States', datetime.date(1949, 6, 7), None, None, 'OS_SGAD', None, None)
(41, 'Charlie Sheen', 'United States', datetime.date(1965, 9, 3), None, 5, 'OS_SGAD', None, None)
(42, 'Emilio Estevez', 'United States', datetime.date(1962, 5, 12), None, 5, 'OS_SGAD', None, None)
(43, 'Ramón Estevez', 'United States', datetime.date(1963, 8, 7), None, 5, 'OS_SGAD', None, None)
(44, 'Reneé Estevez', 'United States', datetime.date(1967, 4, 2), None, 5, 'OS_SGAD', None, None)
(45, 'Paula Speert Sheen', 'United States', datetime.date(1986, 1, 6), None, 41, 'OS_SGAD', None, None)
(46, 'Bob Sheen', 'United States', datetime.date(2009, 5, 1), None, 41, 'OS_SGAD', None, None)
(47, 'Max Sheen', 'United States', datetime.date(2009, 5, 1), None, 41, 'OS_SGAD', None, None)
(48, 'Sam Sheen', 'United States', datetime.date(2004, 3, 9), None, 41, 'OS_SGAD', None, None)
(49, 'Lola Sheen', 'United States', datetime.date(2005, 6, 1), None, 41, 'OS_SGAD', None, None)
(50, 'Paula Jones-Sheen', 'United States', datetime.date(2003, 7, 6), None, 45, 'OS_SGAD', None, None)
(51, 'Paloma Rae Estevez', 'United States', datetime.date(1986, 2, 15), None, 42, 'OS_SGAD', None, None)
(52, 'Taylor Levi Estevez', 'United States', datetime.date(1984, 6, 22), None, 42, 'OS_SGAD', None, None)

In [16]:
show_sql = "SELECT * FROM tb_role;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Actor', 'OS_SGAD', None, None)
(2, 'Director', 'OS_SGAD', None, None)
(3, 'Productor', 'OS_SGAD', None, None)
(4, 'Guionista', 'OS_SGAD', None, None)
(5, 'Música', 'OS_SGAD', None, None)

## Exercise 2

In [17]:
select_sql = """
  SELECT person_name, person_country, person_dob
  FROM tb_person
  WHERE person_dod IS NULL
  ORDER BY person_dob;
"""

crs.execute(select_sql)

result = crs.fetchall()
for x in result:
    print(x)

('John Williams', 'United States', datetime.date(1928, 8, 8))
('Vera Miles', 'United States', datetime.date(1929, 8, 23))
('Sean Connery', 'Scotland', datetime.date(1930, 7, 8))
('Robert Duvall', 'United States', datetime.date(1931, 1, 5))
('Morgan Freeman', 'United States', datetime.date(1935, 10, 1))
('Francis Ford Coppola', 'United States', datetime.date(1939, 4, 7))
('Gary Kurtz', 'United States', datetime.date(1940, 7, 27))
('Martin Sheen', 'United States', datetime.date(1940, 8, 3))
('Harrison Ford', 'United States', datetime.date(1942, 7, 13))
('George Lucas', 'United States', datetime.date(1944, 5, 14))
('Carmine Coppola', 'United States', datetime.date(1945, 7, 8))
('Steven Spielberg', 'United States', datetime.date(1946, 12, 18))
('Tim Robbins', 'United States', datetime.date(1949, 6, 7))
('Mel Gibson', 'Australia', datetime.date(1950, 8, 9))
('Tom Hanks', 'United States', datetime.date(1956, 7, 9))
('Emilio Martinez Lazaro', 'Spain', datetime.date(1956, 9, 9))
('Karra Elejalde', 'Spain', datetime.date(1960, 3, 6))
('Emilio Estevez', 'United States', datetime.date(1962, 5, 12))
('Ramón Estevez', 'United States', datetime.date(1963, 8, 7))
('Carmen Machi', 'Spain', datetime.date(1964, 8, 9))
('Charlie Sheen', 'United States', datetime.date(1965, 9, 3))
('Reneé Estevez', 'United States', datetime.date(1967, 4, 2))
('Catherine Zeta-Jones', 'Wales', datetime.date(1969, 9, 25))
('Robert Alamo', 'Spain', datetime.date(1970, 5, 6))
('Daniel Sanchez Arevalo', 'Spain', datetime.date(1970, 6, 8))
('Quim Gutierrez', 'Spain', datetime.date(1981, 3, 27))
('Veronica Echegui', 'Spain', datetime.date(1983, 3, 14))
('Taylor Levi Estevez', 'United States', datetime.date(1984, 6, 22))
('Dani Rovira', 'Spain', datetime.date(1984, 7, 1))
('Paula Speert Sheen', 'United States', datetime.date(1986, 1, 6))
('Paloma Rae Estevez', 'United States', datetime.date(1986, 2, 15))
('Clara Lago', 'Spain', datetime.date(1986, 4, 17))
('Patrick Criado', 'Spain', datetime.date(1995, 9, 23))
('Paula Jones-Sheen', 'United States', datetime.date(2003, 7, 6))
('Sam Sheen', 'United States', datetime.date(2004, 3, 9))
('Lola Sheen', 'United States', datetime.date(2005, 6, 1))
('Bob Sheen', 'United States', datetime.date(2009, 5, 1))
('Max Sheen', 'United States', datetime.date(2009, 5, 1))

## Exercise 3

In [18]:
select_sql = """
  SELECT genre_name, count(movie_id) as movie_count
  FROM tb_genre JOIN tb_movie
  WHERE genre_id = movie_genre_id
  GROUP BY genre_name
  ORDER BY movie_count DESC;
"""

crs.execute(select_sql)

result = crs.fetchall()
for x in result:
    print(x)

('Comedia', 3)
('Acción', 2)
('Ciencia Ficción', 2)
('Drama', 2)
('Romance', 2)
('Suspense', 2)
('Fantasía', 1)
('Terror', 1)
('Bélico', 1)

## Exercise 4

In [19]:
select_sql = """
  SELECT person_name, max(roles_count)
  FROM (SELECT person_id, count(role_id) AS roles_count
        FROM tb_movie_person
        GROUP BY person_id, movie_id) AS tb_roles_count JOIN tb_person
  WHERE tb_roles_count.person_id = tb_person.person_id AND roles_count > 1
  GROUP BY tb_roles_count.person_id;  
"""

crs.execute(select_sql)

result = crs.fetchall()
for x in result:
    print(x)

('Francis Ford Coppola', 3)
('George Lucas', 2)
('Steven Spielberg', 2)
('Alfred Joseph Hitchcock', 3)
('Daniel Sanchez Arevalo', 2)
('Mel Gibson', 2)

## Exercise 5

See the state of *tb_genre* before it is updated.

In [20]:
pre_show_sql = "SELECT genre_id, genre_name FROM tb_genre"

crs.execute(pre_show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Acción')
(2, 'Ciencia Ficción')
(3, 'Comedia')
(4, 'Drama')
(5, 'Fantasía')
(6, 'Melodrama')
(7, 'Musical')
(8, 'Romance')
(9, 'Suspense')
(10, 'Terror')
(11, 'Bélico')

In [21]:
insert_sql = "INSERT INTO tb_genre (genre_id, genre_name) VALUES (%s, %s);"
val = (69, "Documental")

crs.execute(insert_sql, val)

cnn.commit()

See the state of *tb_genre* after it is updated.

In [22]:
post_show_sql = "SELECT genre_id, genre_name FROM tb_genre"

crs.execute(post_show_sql)

result = crs.fetchall()

for x in result:
    print(x)

(1, 'Acción')
(2, 'Ciencia Ficción')
(3, 'Comedia')
(4, 'Drama')
(5, 'Fantasía')
(6, 'Melodrama')
(7, 'Musical')
(8, 'Romance')
(9, 'Suspense')
(10, 'Terror')
(11, 'Bélico')
(69, 'Documental')

## Exercise 6

Deleting a row in the table *tb_movie* will compromise the database's integrity. Previously, it is necessary to update the constraint *fk_movper_movie* and set it to "*DELETE ON CASCADE*". It is not possible to update a constraint, so the old one has to be deleted and then add the new one.<br>
The first statement shows all the constraints in *tb_movie_person*.

In [23]:
show_constraint_sql = """
SELECT COLUMN_NAME, CONSTRAINT_NAME, REFERENCED_COLUMN_NAME, REFERENCED_TABLE_NAME
FROM information_schema.KEY_COLUMN_USAGE
WHERE TABLE_NAME = 'tb_movie_person';
"""

crs.execute(show_constraint_sql)

result = crs.fetchall()
for x in result:
    print(x)

('movie_id', 'PRIMARY', None, None)
('person_id', 'PRIMARY', None, None)
('role_id', 'PRIMARY', None, None)
('movie_id', 'fk_movper_movie', 'movie_id', 'tb_movie')
('person_id', 'fk_movper_person', 'person_id', 'tb_person')
('role_id', 'fk_movper_role', 'role_id', 'tb_role')

In [24]:
drop_fk_sql = "ALTER TABLE tb_movie_person DROP CONSTRAINT fk_movper_movie;"

crs.execute(drop_fk_sql)

cnn.commit()

In [25]:
show_constraint_sql = """
select COLUMN_NAME, CONSTRAINT_NAME, REFERENCED_COLUMN_NAME, REFERENCED_TABLE_NAME
from information_schema.KEY_COLUMN_USAGE
where TABLE_NAME = 'tb_movie_person';
"""

crs.execute(show_constraint_sql)

result = crs.fetchall()
for x in result:
    print(x)

('movie_id', 'PRIMARY', None, None)
('person_id', 'PRIMARY', None, None)
('role_id', 'PRIMARY', None, None)
('person_id', 'fk_movper_person', 'person_id', 'tb_person')
('role_id', 'fk_movper_role', 'role_id', 'tb_role')

In [26]:
add_fk_sql = """
ALTER TABLE tb_movie_person ADD CONSTRAINT fk_movper_movie FOREIGN KEY (movie_id) 
REFERENCES movies.tb_movie (movie_id) ON DELETE CASCADE;
"""

crs.execute(add_fk_sql)

cnn.commit()

In [27]:
show_constraint_sql = """
select COLUMN_NAME, CONSTRAINT_NAME, REFERENCED_COLUMN_NAME, REFERENCED_TABLE_NAME
from information_schema.KEY_COLUMN_USAGE
where TABLE_NAME = 'tb_movie_person';
"""

crs.execute(show_constraint_sql)

result = crs.fetchall()
for x in result:
    print(x)

('movie_id', 'PRIMARY', None, None)
('person_id', 'PRIMARY', None, None)
('role_id', 'PRIMARY', None, None)
('movie_id', 'fk_movper_movie', 'movie_id', 'tb_movie')
('person_id', 'fk_movper_person', 'person_id', 'tb_person')
('role_id', 'fk_movper_role', 'role_id', 'tb_role')

Now, it is possible to delete a row in *tb_movie* without compromising the database's integrity.

In [28]:
show_sql = "SELECT * FROM tb_movie;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(11, 'La Gran Familia Española', datetime.date(2012, 10, 15), 'Digital', 3, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

In [29]:
delete_row_sql = "DELETE FROM tb_movie WHERE movie_title = 'La Gran Familia Española';"

crs.execute(delete_row_sql)

cnn.commit()

In [30]:
show_sql = "SELECT * FROM tb_movie;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

## Exercise 7

Update the row with *movie_title* "Ocho Apellidos Catalanes" in the table *tb_movie*. The genre relation has to be updated from "Romance" to "Comedia".

In [31]:
show_sql = "SELECT * FROM tb_movie;"

crs.execute(show_sql)

result = crs.fetchall()
for x in result:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

In [32]:
update_sql = """
UPDATE tb_movie
SET movie_genre_id = (SELECT genre_id FROM tb_genre WHERE genre_name = 'Comedia')
WHERE movie_title = "Ocho Apellidos Catalanes;"
"""

crs.execute(update_sql)

cnn.commit()

In [33]:
show_sql = "SELECT * FROM tb_movie;"

crs.execute(show_sql)

result = crs.fetchall()

for x in result:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)